c.org
#+TITLE: C
#+OPTIONS: num:nil
#+SETUPFILE: /home/silin/.emacs.d/org-html-themes/org/theme-bigblow.setup
#+STARTUP: content
* Program
** int converse to 8, 16 Base and char with ASCII
#+BEGIN_SRC C++ :results output :session
  #include <stdio.h>
  int main( )
  {
    int a = 80;
    printf("the input a is %d\n",a);
    printf("converse to 8 base is %#o\n", a);
    printf("converse to 16 base is %#X\n", a);
    printf("converse to char is %c\n", a);
    return 0;
  }

#+END_SRC

#+RESULTS:
: the input a is 80
: converse to 8 base is 0120
: converse to 16 base is 0X50
: converse to char is P

** Primzahl

#+BEGIN_SRC C++ :results output
  #include<stdio.h> 
  #include"math.h"
  int main( )
  {
    int i;
    int j;
    for (i = 2; i < 10; i++) {
      int temp = (int)sqrt(i);
      for (j = 1; j <= 1000; j++) {
        if (j != 1 && i%j == 0 ) {
          break;
        }else {
          if (j == temp) {
            printf("%d \n",i);
            break;
          }
        }
      }
    }
    return 0;
  }

#+END_SRC

#+RESULTS:
: 2 
: 3 
: 5 
: 7

** atoi & itoa
atoi, 如有非数字字符，就为0
itoa , 非ASCII标准函数库，看collection.
#+BEGIN_SRC C++ :results output

#include <stdio.h>
#include <stdlib.h>

char* itoa(int val, int base){
  static char buf[32] = {0};
  int i = 30;
  for(; val && i ; --i, val /= base)
    buf[i] = "0123456789abcdef"[val % base];
  return &buf[i+1];
}


int main(int argc, char *argv[])
{
  int a = 100;
  char* Str = itoa(a, 8);
  printf("%s \n",Str);
  return 0;

}

#+END_SRC

#+RESULTS:
: 144

* Point&array
** pointer and array description
| *p = a[n]         | p             | a            |
|-------------------+---------------+--------------|
| the first Value   | *p    /  p[0] | *a  /  a[0]  |
| the n-th Value    | *(p+n)/  p[n] | *a+n/  a[n]  |
| the first Address | p     /       | a   /  &a[0] |
| the n-th  Address | p+n   /       | &a[n]        |
|-------------------+---------------+--------------|

#+BEGIN_SRC cpp :results output
  #include <iostream>
  int main(){
    int a[]={1,2,3,4,5};
    int *p = a;
    printf("Print this hallo!\n");
    printf("for value\n");
    printf("%d\n",*p);
    printf("%d\n",*a);
    printf("%d\n",a[0]);
    printf("%d\n",p[0]);
    printf("nihao :%d\n",*(p+1));
    printf("%d\n",*a+1);
    printf("%d\n",a[1]+1);
    printf("%d\n",p[1]+1);
    printf("for address:\n");
    printf("%d\n",p);
    printf("%d\n",a);
    printf("%d\n",&a[0]);
    printf("%d\n",p+2);
    printf("%d\n",&a[2]);
    printf("%c\n","0123456789abcdef"[3]);
    char *list = "0123456789abcdef";
    printf("%s\n",&list[10]);
    return 0;
  }

#+END_SRC

#+RESULTS:
#+begin_example
Print this hallo!
for value
1
1
1
1
nihao :2
2
3
3
for address:
-879903088
-879903088
-879903088
-879903080
-879903080
3
abcdef
#+end_example

#+begin_example
Print this hallo!
for value
1
1
1
1
nihao :2
2
3
3
for address:
609365712
609365712
609365712
609365720

609365720
3
abcdef
#+end_example

在传递过程中，
数组的传递可以用指针来接受，
指针的传递可以用数组来接受，但必须是指针类型的数组

