c.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-23 Mo 20:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="silin" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">C</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c9efcf">Program</a>
<ul>
<li><a href="#orgc3e6033">int converse to 8, 16 Base and char with ASCII</a></li>
<li><a href="#org1e3e1f5">Primzahl</a></li>
<li><a href="#org1282771">atoi &amp; itoa</a></li>
</ul>
</li>
<li><a href="#org21d6820">Point&amp;array</a>
<ul>
<li><a href="#orgcaa8189">pointer and array description</a></li>
<li><a href="#org2f8490a">Beispile</a></li>
<li><a href="#orga3e0bf9">二维数组 转 二维数组指针 &amp; 指针数组 转 二级指针</a></li>
<li><a href="#orga657d94">Summary</a></li>
<li><a href="#org338d8b9">2 Order Point</a>
<ul>
<li><a href="#orge6c5c84">Assignment to int *</a></li>
<li><a href="#orgb2f1d9b">Dichotomy</a></li>
<li><a href="#orga363b77">1D array and 1D Point array [] &gt; * &gt; +</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga74802d">Polymorphism</a>
<ul>
<li><a href="#orgbde6ede">C++ 先基后子</a></li>
<li><a href="#org3d3f498">Python 可基可子</a></li>
<li><a href="#org40c7069">Java 先子后基，还必须子实列指向基类型</a></li>
</ul>
</li>
<li><a href="#org648b7da">Scanf</a>
<ul>
<li><a href="#org3499b9f">input matching for multi input Scanf()</a></li>
<li><a href="#org52d5823">清空每次输入的所有缓存</a></li>
<li><a href="#org9d48997">Scanf(%{*}{width}type)</a></li>
<li><a href="#org95026bd">each time only reserive 3 agruments</a></li>
<li><a href="#org9b83949">special requirements</a></li>
</ul>
</li>
<li><a href="#org57744f0">Notes</a>
<ul>
<li><a href="#org8111cb9">pass the agruments to program</a></li>
<li><a href="#org4587bb7">malloc for 2 diamesion</a></li>
<li><a href="#orgb14d31b">pass 2 diamesion array to function</a></li>
<li><a href="#orgc37096a">char for string</a></li>
<li><a href="#orge5e217b">Headfile</a></li>
<li><a href="#orgebf3850">reference</a></li>
<li><a href="#org3d86e94">class</a></li>
<li><a href="#orgc20c89f">const</a></li>
<li><a href="#org220f360">static</a></li>
<li><a href="#org4731680">GDB</a></li>
</ul>
</li>
<li><a href="#org3727cb4">Compile</a>
<ul>
<li><a href="#orga2b62e0">Makefile</a></li>
<li><a href="#orgffdf478">Terminal Compile</a></li>
<li><a href="#org53baa51">Emacs Compile</a></li>
<li><a href="#orgb778bdc">Orgmode Compile</a></li>
</ul>
</li>
<li><a href="#orgdc18a12">GDB</a>
<ul>
<li><a href="#orgc3888d2">command</a></li>
<li><a href="#org5c3401a">Problems</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7c9efcf" class="outline-2">
<h2 id="org7c9efcf">Program</h2>
<div class="outline-text-2" id="text-org7c9efcf">
</div>
<div id="outline-container-orgc3e6033" class="outline-3">
<h3 id="orgc3e6033">int converse to 8, 16 Base and char with ASCII</h3>
<div class="outline-text-3" id="text-orgc3e6033">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>( )
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span> = 80;
  printf(<span style="color: #2d9574;">"the input a is %d\n"</span>,a);
  printf(<span style="color: #2d9574;">"converse to 8 base is %#o\n"</span>, a);
  printf(<span style="color: #2d9574;">"converse to 16 base is %#X\n"</span>, a);
  printf(<span style="color: #2d9574;">"converse to char is %c\n"</span>, a);
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org1e3e1f5" class="outline-3">
<h3 id="org1e3e1f5">Primzahl</h3>
<div class="outline-text-3" id="text-org1e3e1f5">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span><span style="color: #2d9574;">&lt;stdio.h&gt;</span> 
<span style="color: #bc6ec5;">#include</span><span style="color: #2d9574;">"math.h"</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>( )
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> (i = 2; i &lt; 10; i++) {
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">temp</span> = (<span style="color: #ce537a; font-weight: bold;">int</span>)sqrt(i);
    <span style="color: #4f97d7; font-weight: bold;">for</span> (j = 1; j &lt;= 1000; j++) {
      <span style="color: #4f97d7; font-weight: bold;">if</span> (j != 1 &amp;&amp; i%j == 0 ) {
        <span style="color: #4f97d7; font-weight: bold;">break</span>;
      }<span style="color: #4f97d7; font-weight: bold;">else</span> {
        <span style="color: #4f97d7; font-weight: bold;">if</span> (j == temp) {
          printf(<span style="color: #2d9574;">"%d \n"</span>,i);
          <span style="color: #4f97d7; font-weight: bold;">break</span>;
        }
      }
    }
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org1282771" class="outline-3">
<h3 id="org1282771">atoi &amp; itoa</h3>
<div class="outline-text-3" id="text-org1282771">
<p>
atoi, 如有非数字字符，就为0
itoa , 非ASCII标准函数库，看collection.
</p>
<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdlib.h&gt;</span>

<span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #bc6ec5; font-weight: bold;">itoa</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">val</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">base</span>){
  <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">buf</span>[32] = {0};
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 30;
  <span style="color: #4f97d7; font-weight: bold;">for</span>(; val &amp;&amp; i ; --i, val /= base)
    buf[i] = <span style="color: #2d9574;">"0123456789abcdef"</span>[val % base];
  <span style="color: #4f97d7; font-weight: bold;">return</span> &amp;buf[i+1];
}


<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span> = 100;
  <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">Str</span> = itoa(a, 8);
  printf(<span style="color: #2d9574;">"%s \n"</span>,Str);
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;

}

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org21d6820" class="outline-2">
<h2 id="org21d6820">Point&amp;array</h2>
<div class="outline-text-2" id="text-org21d6820">
</div>
<div id="outline-container-orgcaa8189" class="outline-3">
<h3 id="orgcaa8189">pointer and array description</h3>
<div class="outline-text-3" id="text-orgcaa8189">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">*p = a[n]</th>
<th scope="col" class="org-left">p</th>
<th scope="col" class="org-left">a</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">the first Value</td>
<td class="org-left">*p    /  p[0]</td>
<td class="org-left">*a  /  a[0]</td>
</tr>

<tr>
<td class="org-left">the n-th Value</td>
<td class="org-left">*(p+n)/  p[n]</td>
<td class="org-left">*a+n/  a[n]</td>
</tr>

<tr>
<td class="org-left">the first Address</td>
<td class="org-left">p     /</td>
<td class="org-left">a   /  &amp;a[0]</td>
</tr>

<tr>
<td class="org-left">the n-th  Address</td>
<td class="org-left">p+n   /</td>
<td class="org-left">&amp;a[n]</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;iostream&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(){
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>[]={1,2,3,4,5};
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">p</span> = a;
  printf(<span style="color: #2d9574;">"Print this hallo!\n"</span>);
  printf(<span style="color: #2d9574;">"for value\n"</span>);
  printf(<span style="color: #2d9574;">"%d\n"</span>,*p);
  printf(<span style="color: #2d9574;">"%d\n"</span>,*a);
  printf(<span style="color: #2d9574;">"%d\n"</span>,a[0]);
  printf(<span style="color: #2d9574;">"%d\n"</span>,p[0]);
  printf(<span style="color: #2d9574;">"nihao :%d\n"</span>,*(p+1));
  printf(<span style="color: #2d9574;">"%d\n"</span>,*a+1);
  printf(<span style="color: #2d9574;">"%d\n"</span>,a[1]+1);
  printf(<span style="color: #2d9574;">"%d\n"</span>,p[1]+1);
  printf(<span style="color: #2d9574;">"for address:\n"</span>);
  printf(<span style="color: #2d9574;">"%d\n"</span>,p);
  printf(<span style="color: #2d9574;">"%d\n"</span>,a);
  printf(<span style="color: #2d9574;">"%d\n"</span>,&amp;a[0]);
  printf(<span style="color: #2d9574;">"%d\n"</span>,p+2);
  printf(<span style="color: #2d9574;">"%d\n"</span>,&amp;a[2]);
  printf(<span style="color: #2d9574;">"%c\n"</span>,<span style="color: #2d9574;">"0123456789abcdef"</span>[3]);
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">list</span> = <span style="color: #2d9574;">"0123456789abcdef"</span>;
  printf(<span style="color: #2d9574;">"%s\n"</span>,&amp;list[10]);
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example" id="orgd0622ae">
Print this hallo!
for value
1
1
1
1
nihao :2
2
3
3
for address:
609365712
609365712
609365712
609365720

609365720
3
abcdef
</pre>

<p>
在传递过程中，
数组的传递可以用指针来接受，
指针的传递可以用数组来接受，但必须是指针类型的数组
</p>
</div>
</div>
