c.org
** Beispile


#+begin_src C :results output
  #include <stdio.h>
  #include <string.h>
  #include <ctype.h>
  int main(int argc, char *argv[])
  {
    if (argc <= 1) {
      return -1;
    }
    char a = argv[1][0];
    char b = 'c';
    if (isupper(a)) {
      if(tolower(a) == b){
        printf("all right\n");
      }else{
        printf("not the case \n");
      }
    }else{
      if (a == b) {
        printf("all right\n");
      }else{
        printf("not the case \n");
      }
    }
    return 0;
  }

#+end_src

** 二维数组 转 二维数组指针 & 指针数组 转 二级指针
#+BEGIN_SRC C :results output
#include <stdio.h>
int main(int argc, char *argv[])
{
 //   二维数组 转 二维数组指针 
  int a[3][3] = {{1,2,3},{4,5,6},{7,8,9}};
  int (*p)[3] = a;
  for (int i = 0; i < 3; i++) {
    for (int j = 0; j < 3; ++j) {
      printf("%d  ", *(*(p+i)+j));
      printf("%d |", p[i][j] );
    }
    printf("  \n");
  }
  // 指针数组  转  二级指针
  int *array[3] = {a[0], a[1], a[2]};
  int **q = array;
  for (int i = 0; i < 3; ++i) {
    for (int j = 0; j < 3; ++j) {
      printf("%d  ", q[i][j] );
      printf("%d |", *(*(q+i)+j));
    }
    printf("  \n");
  }
  return 0;
}
#+END_SRC

#+RESULTS:
: 1  1 |2  2 |3  3 |  
: 4  4 |5  5 |6  6 |  
: 7  7 |8  8 |9  9 |  
: 1  1 |2  2 |3  3 |  
: 4  4 |5  5 |6  6 |  
: 7  7 |8  8 |9  9 |

: 1  1 |2  2 |3  3 |  
: 4  4 |5  5 |6  6 |  
: 7  7 |8  8 |9  9 |  
: 1  1 |2  2 |3  3 |  
: 4  4 |5  5 |6  6 |  
: 7  7 |8  8 |9  9 |

with dypedef, 数组指针接收二维数组

#+BEGIN_SRC C :results output
#include <stdio.h>
typedef int(*R)[3];

R fun(int b[2][3]){
  return b;
}

int main(int argc, char *argv[])
{
  int i, j;
  int a[2][3] = {1, 2, 3, 4, 5, 6};
  R c = fun(a);
  for (i = 0; i < 2; ++i) {
    for (j = 0; j < 3; ++j) {
      printf("c[%d][%d] is %d \n", i, j, c[i][j]);
    }
  }
 return 0;
}

#+END_SRC

: c[0][0] is 1 
: c[0][1] is 2 
: c[0][2] is 3 
: c[1][0] is 4 
 without dypedef

: c[1][1] is 5 
: c[1][2] is 6

#+BEGIN_SRC C :results output
#include <stdio.h>

int(*fun(int b[2][3]))[3]{
  return b;
}

int main(int argc, char *argv[])
{
  int i, j;
  int a[2][3] = {1, 2, 3, 4, 5, 6};
  int (*c)[3] = fun(a);
  for (i = 0; i < 2; ++i) {
    for (j = 0; j < 3; ++j) {
      printf("c[%d][%d] is %d \n", i, j, c[i][j]);
    }
  }
 return 0;
}

#+END_SRC

: c[0][0] is 1 
: c[0][1] is 2 
: c[0][2] is 3 
: c[1][0] is 4 
: c[1][1] is 5 
: c[1][2] is 6

