c.html

<div id="outline-container-org2f8490a" class="outline-3">
<h3 id="org2f8490a">Beispile</h3>
<div class="outline-text-3" id="text-org2f8490a">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;string.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;ctype.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{
  <span style="color: #4f97d7; font-weight: bold;">if</span> (argc &lt;= 1) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> -1;
  }
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">a</span> = argv[1][0];
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">b</span> = <span style="color: #2d9574;">'c'</span>;
  <span style="color: #4f97d7; font-weight: bold;">if</span> (isupper(a)) {
    <span style="color: #4f97d7; font-weight: bold;">if</span>(tolower(a) == b){
      printf(<span style="color: #2d9574;">"all right\n"</span>);
    }<span style="color: #4f97d7; font-weight: bold;">else</span>{
      printf(<span style="color: #2d9574;">"not the case \n"</span>);
    }
  }<span style="color: #4f97d7; font-weight: bold;">else</span>{
    <span style="color: #4f97d7; font-weight: bold;">if</span> (a == b) {
      printf(<span style="color: #2d9574;">"all right\n"</span>);
    }<span style="color: #4f97d7; font-weight: bold;">else</span>{
      printf(<span style="color: #2d9574;">"not the case \n"</span>);
    }
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orga3e0bf9" class="outline-3">
<h3 id="orga3e0bf9">二维数组 转 二维数组指针 &amp; 指针数组 转 二级指针</h3>
<div class="outline-text-3" id="text-orga3e0bf9">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{
 <span style="color: #2aa1ae; background-color: #292e34;">//   </span><span style="color: #2aa1ae; background-color: #292e34;">&#20108;&#32500;&#25968;&#32452; &#36716; &#20108;&#32500;&#25968;&#32452;&#25351;&#38024; </span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>[3][3] = {{1,2,3},{4,5,6},{7,8,9}};
  <span style="color: #ce537a; font-weight: bold;">int</span> (*<span style="color: #7590db;">p</span>)[3] = a;
  <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; 3; i++) {
    <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0; j &lt; 3; ++j) {
      printf(<span style="color: #2d9574;">"%d  "</span>, *(*(p+i)+j));
      printf(<span style="color: #2d9574;">"%d |"</span>, p[i][j] );
    }
    printf(<span style="color: #2d9574;">"  \n"</span>);
  }
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25351;&#38024;&#25968;&#32452;  &#36716;  &#20108;&#32423;&#25351;&#38024;</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">array</span>[3] = {a[0], a[1], a[2]};
  <span style="color: #ce537a; font-weight: bold;">int</span> **<span style="color: #7590db;">q</span> = array;
  <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; 3; ++i) {
    <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0; j &lt; 3; ++j) {
      printf(<span style="color: #2d9574;">"%d  "</span>, q[i][j] );
      printf(<span style="color: #2d9574;">"%d |"</span>, *(*(q+i)+j));
    }
    printf(<span style="color: #2d9574;">"  \n"</span>);
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
1  1 |2  2 |3  3 |  
4  4 |5  5 |6  6 |  
7  7 |8  8 |9  9 |  
1  1 |2  2 |3  3 |  
4  4 |5  5 |6  6 |  
7  7 |8  8 |9  9 |
</pre>


<p>
with dypedef, 数组指针接收二维数组
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #4f97d7; font-weight: bold;">typedef</span> <span style="color: #ce537a; font-weight: bold;">int</span>(*<span style="color: #ce537a; font-weight: bold;">R</span>)[3];

<span style="color: #ce537a; font-weight: bold;">R</span> <span style="color: #bc6ec5; font-weight: bold;">fun</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>[2][3]){
  <span style="color: #4f97d7; font-weight: bold;">return</span> b;
}

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>, <span style="color: #7590db;">j</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>[2][3] = {1, 2, 3, 4, 5, 6};
  <span style="color: #ce537a; font-weight: bold;">R</span> <span style="color: #7590db;">c</span> = fun(a);
  <span style="color: #4f97d7; font-weight: bold;">for</span> (i = 0; i &lt; 2; ++i) {
    <span style="color: #4f97d7; font-weight: bold;">for</span> (j = 0; j &lt; 3; ++j) {
      printf(<span style="color: #2d9574;">"c[%d][%d] is %d \n"</span>, i, j, c[i][j]);
    }
  }
 <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example">
c[0][0] is 1 
c[0][1] is 2 
c[0][2] is 3 
c[1][0] is 4 
</pre>

<p>
without dypedef
</p>

<pre class="example">
c[1][1] is 5 
c[1][2] is 6
</pre>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span>(*<span style="color: #7590db;">fun</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>[2][3]))[3]{
  <span style="color: #4f97d7; font-weight: bold;">return</span> b;
}

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>, <span style="color: #7590db;">j</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>[2][3] = {1, 2, 3, 4, 5, 6};
  <span style="color: #ce537a; font-weight: bold;">int</span> (*<span style="color: #7590db;">c</span>)[3] = fun(a);
  <span style="color: #4f97d7; font-weight: bold;">for</span> (i = 0; i &lt; 2; ++i) {
    <span style="color: #4f97d7; font-weight: bold;">for</span> (j = 0; j &lt; 3; ++j) {
      printf(<span style="color: #2d9574;">"c[%d][%d] is %d \n"</span>, i, j, c[i][j]);
    }
  }
 <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example">
c[0][0] is 1 
c[0][1] is 2 
c[0][2] is 3 
c[1][0] is 4 
c[1][1] is 5 
c[1][2] is 6
</pre>
</div>
</div>
