c.org
** Summary

|            | 1            | 3           | 2           | 4           |
|------------+--------------+-------------+-------------+-------------|
| Form       | char *argv[] | int *a3[]   | int *a2     | int a4[][2] |
|------------+--------------+-------------+-------------+-------------|
| 传递时时参 | argv         | a3          | &a2         | a4          |
|------------+--------------+-------------+-------------+-------------|
| 接收时形参 | char **p1    | int **p3    | int **p2    | int(*p4)[2] |
|------------+--------------+-------------+-------------+-------------|
|            | argv[1][2]   | a3[0][1]    | a2[2]       | a4[1][0]    |
|            | p1[1][2]     | p3[0][1]    | p2[0][2]    | p4[1][0]    |

|            | *(*(p+1)+2)  | *(*(p+0)+1) | *(*(p+0)+2) | *(*(p+1)+0) |

#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(int argc, char *argv[])

  { 
    char **p1 = argv;
    printf("%c \n", argv[1][2]   );
    printf("%c \n", p1[1][2]     );
    printf("%c \n", *(*(p1+1)+2) );


    int b2[] = {1, 2, 3, 4, 5};
    int *a2 = b2;
    int **p2 = &a2;
    printf("%d \n", a2[1]         );
    printf("%d \n", *(a2+1)       );
    printf("%d \n", p2[0][1]      );
    printf("%d \n", *(*(p2+0)+1)  );

    int m[] = {1,2};
    int n[] = {3,4};
    int *a3[] = {m, n};
    int **p3 = a3;
    printf("%d \n", a3[0][1]      );
    printf("%d \n", p3[0][1]      );
    printf("%d \n", *(*(p3+0)+1)  );

    return 0;

    int a4[][2]  ={{1,2},{3,4}};
    int (*p4)[2] = a4;
    printf("%d \n", a4[1][0]      );
    printf("%d \n", p4[1][0]      );
    printf("%d \n", *(*(p4+1)+0)  );

  }


#+END_SRC

#+RESULTS:

** 2 Order Point
*** Assignment to int *
For 2 order Point **a, we have assigned (*a, a, &a) to int * separately.
#+begin_src C :results output
#include <stdio.h>
void Point2order(int **a){
  printf("**a : %d\n",**a );
  printf("*a  : %d\n",*a );  
  printf(" a  : %d\n", a );
  printf("&a  : %d\n",&a );
  printf("\n");
  int *z = *a;
  printf("  int *z = *a : if z = *a\n");
  printf("z  : %d\n", z );
  printf("*a : %d\n", *a );
  printf("if *z = **a\n");
  printf("*z :%d\n", *z );
  printf("**a:%d\n",  **a );
  printf("\n");
  int *y = a;
  printf("  int *y = a : if y = a\n");
  printf("y  : %d\n", y );
  printf("a  : %d\n", a );
  printf("if *y = *a\n");
  printf("*y : %d\n", *y );
  printf("*a : %d\n",  *a );
  printf("\n");
  int *x = &a;
  printf("  int *x = &a : if x = &a\n");
  printf("x  : %d\n", x );
  printf("&a : %d\n", &a );
  printf("if *x = *(&a)\n");
  printf("*x : %d\n", *x );
  printf("*&a: %d\n",  *(&a) );
}
int main(int argc, char *argv[])
{

  int aa[] = {10,20,30};
  int *a = aa;
  Point2order(&a);
  return 0;
}
#+end_src

*** Dichotomy
#+begin_src C :results output
#include <stdio.h>
int dich(int ** p, int *start, int *end, int x){
  if (*p == NULL) {
    return 0;
  }
  if (x <*start || x > *end) {
    return 0;
  }
  if (x == *start || x == *end) {
    return 1;
  }

  int i = 0;
  for (int *n = *p; *n != *end; n++) {
    i++;
  }

  int mid = *(*p+i/2);
  if (mid >= x) {
    return dich(p, start, &mid, x);
  }else{
    int *pos = *p+i/2;
    return dich(&pos, &mid, end, x);
  }
}
int main(int argc, char *argv[])
{
  int a[] = {1,2,3,5,78,345,678,3456,34567,98765};
  int *p = a;
  int x = 5;
  int len=sizeof(a)/sizeof(int);
  int start = a[0];
  int end = a[len-1];
    
  /* if(dich(&p, a, &end, x)){ */
  if(dich(&p, &start, &end, x)){
    printf("In \n");
  }else{
    printf("Not In\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: In

