c.html

<div id="outline-container-orga657d94" class="outline-3">
<h3 id="orga657d94">Summary</h3>
<div class="outline-text-3" id="text-orga657d94">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">1</th>
<th scope="col" class="org-left">3</th>
<th scope="col" class="org-left">2</th>
<th scope="col" class="org-left">4</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Form</td>
<td class="org-left">char *argv[]</td>
<td class="org-left">int *a3[]</td>
<td class="org-left">int *a2</td>
<td class="org-left">int a4[][2]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">传递时时参</td>
<td class="org-left">argv</td>
<td class="org-left">a3</td>
<td class="org-left">&amp;a2</td>
<td class="org-left">a4</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">接收时形参</td>
<td class="org-left">char **p1</td>
<td class="org-left">int **p3</td>
<td class="org-left">int **p2</td>
<td class="org-left">int(*p4)[2]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">argv[1][2]</td>
<td class="org-left">a3[0][1]</td>
<td class="org-left">a2[2]</td>
<td class="org-left">a4[1][0]</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">p1[1][2]</td>
<td class="org-left">p3[0][1]</td>
<td class="org-left">p2[0][2]</td>
<td class="org-left">p4[1][0]</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">*(*(p+1)+2)</td>
<td class="org-left">*(*(p+0)+1)</td>
<td class="org-left">*(*(p+0)+2)</td>
<td class="org-left">*(*(p+1)+0)</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])

{ 
  <span style="color: #ce537a; font-weight: bold;">char</span> **<span style="color: #7590db;">p1</span> = argv;
  printf(<span style="color: #2d9574;">"%c \n"</span>, argv[1][2]   );
  printf(<span style="color: #2d9574;">"%c \n"</span>, p1[1][2]     );
  printf(<span style="color: #2d9574;">"%c \n"</span>, *(*(p1+1)+2) );


  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b2</span>[] = {1, 2, 3, 4, 5};
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">a2</span> = b2;
  <span style="color: #ce537a; font-weight: bold;">int</span> **<span style="color: #7590db;">p2</span> = &amp;a2;
  printf(<span style="color: #2d9574;">"%d \n"</span>, a2[1]         );
  printf(<span style="color: #2d9574;">"%d \n"</span>, *(a2+1)       );
  printf(<span style="color: #2d9574;">"%d \n"</span>, p2[0][1]      );
  printf(<span style="color: #2d9574;">"%d \n"</span>, *(*(p2+0)+1)  );

  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">m</span>[] = {1,2};
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>[] = {3,4};
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">a3</span>[] = {m, n};
  <span style="color: #ce537a; font-weight: bold;">int</span> **<span style="color: #7590db;">p3</span> = a3;
  printf(<span style="color: #2d9574;">"%d \n"</span>, a3[0][1]      );
  printf(<span style="color: #2d9574;">"%d \n"</span>, p3[0][1]      );
  printf(<span style="color: #2d9574;">"%d \n"</span>, *(*(p3+0)+1)  );

  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;

  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a4</span>[][2]  ={{1,2},{3,4}};
  <span style="color: #ce537a; font-weight: bold;">int</span> (*<span style="color: #7590db;">p4</span>)[2] = a4;
  printf(<span style="color: #2d9574;">"%d \n"</span>, a4[1][0]      );
  printf(<span style="color: #2d9574;">"%d \n"</span>, p4[1][0]      );
  printf(<span style="color: #2d9574;">"%d \n"</span>, *(*(p4+1)+0)  );

}


</pre>
</div>
</div>
</div>

<div id="outline-container-org338d8b9" class="outline-3">
<h3 id="org338d8b9">2 Order Point</h3>
<div class="outline-text-3" id="text-org338d8b9">
</div>
<div id="outline-container-orge6c5c84" class="outline-4">
<h4 id="orge6c5c84">Assignment to int *</h4>
<div class="outline-text-4" id="text-orge6c5c84">
<p>
For 2 order Point **a, we have assigned (*a, a, &amp;a) to int * separately.
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">Point2order</span>(<span style="color: #ce537a; font-weight: bold;">int</span> **<span style="color: #7590db;">a</span>){
  printf(<span style="color: #2d9574;">"**a : %d\n"</span>,**a );
  printf(<span style="color: #2d9574;">"*a  : %d\n"</span>,*a );  
  printf(<span style="color: #2d9574;">" a  : %d\n"</span>, a );
  printf(<span style="color: #2d9574;">"&amp;a  : %d\n"</span>,&amp;a );
  printf(<span style="color: #2d9574;">"\n"</span>);
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">z</span> = *a;
  printf(<span style="color: #2d9574;">"  int *z = *a : if z = *a\n"</span>);
  printf(<span style="color: #2d9574;">"z  : %d\n"</span>, z );
  printf(<span style="color: #2d9574;">"*a : %d\n"</span>, *a );
  printf(<span style="color: #2d9574;">"if *z = **a\n"</span>);
  printf(<span style="color: #2d9574;">"*z :%d\n"</span>, *z );
  printf(<span style="color: #2d9574;">"**a:%d\n"</span>,  **a );
  printf(<span style="color: #2d9574;">"\n"</span>);
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">y</span> = a;
  printf(<span style="color: #2d9574;">"  int *y = a : if y = a\n"</span>);
  printf(<span style="color: #2d9574;">"y  : %d\n"</span>, y );
  printf(<span style="color: #2d9574;">"a  : %d\n"</span>, a );
  printf(<span style="color: #2d9574;">"if *y = *a\n"</span>);
  printf(<span style="color: #2d9574;">"*y : %d\n"</span>, *y );
  printf(<span style="color: #2d9574;">"*a : %d\n"</span>,  *a );
  printf(<span style="color: #2d9574;">"\n"</span>);
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">x</span> = &amp;a;
  printf(<span style="color: #2d9574;">"  int *x = &amp;a : if x = &amp;a\n"</span>);
  printf(<span style="color: #2d9574;">"x  : %d\n"</span>, x );
  printf(<span style="color: #2d9574;">"&amp;a : %d\n"</span>, &amp;a );
  printf(<span style="color: #2d9574;">"if *x = *(&amp;a)\n"</span>);
  printf(<span style="color: #2d9574;">"*x : %d\n"</span>, *x );
  printf(<span style="color: #2d9574;">"*&amp;a: %d\n"</span>,  *(&amp;a) );
}
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{

  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">aa</span>[] = {10,20,30};
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">a</span> = aa;
  Point2order(&amp;a);
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2f1d9b" class="outline-4">
<h4 id="orgb2f1d9b">Dichotomy</h4>
<div class="outline-text-4" id="text-orgb2f1d9b">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">dich</span>(<span style="color: #ce537a; font-weight: bold;">int</span> ** <span style="color: #7590db;">p</span>, <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">start</span>, <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">end</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">x</span>){
  <span style="color: #4f97d7; font-weight: bold;">if</span> (*p == <span style="color: #a45bad;">NULL</span>) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
  }
  <span style="color: #4f97d7; font-weight: bold;">if</span> (x &lt;*start || x &gt; *end) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
  }
  <span style="color: #4f97d7; font-weight: bold;">if</span> (x == *start || x == *end) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> 1;
  }

  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0;
  <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">n</span> = *p; *n != *end; n++) {
    i++;
  }

  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">mid</span> = *(*p+i/2);
  <span style="color: #4f97d7; font-weight: bold;">if</span> (mid &gt;= x) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> dich(p, start, &amp;mid, x);
  }<span style="color: #4f97d7; font-weight: bold;">else</span>{
    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">pos</span> = *p+i/2;
    <span style="color: #4f97d7; font-weight: bold;">return</span> dich(&amp;pos, &amp;mid, end, x);
  }
}
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>[] = {1,2,3,5,78,345,678,3456,34567,98765};
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">p</span> = a;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">x</span> = 5;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">len</span>=<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(a)/<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>);
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">start</span> = a[0];
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">end</span> = a[len-1];

  <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">if(dich(&amp;p, a, &amp;end, x)){</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span>(dich(&amp;p, &amp;start, &amp;end, x)){
    printf(<span style="color: #2d9574;">"In \n"</span>);
  }<span style="color: #4f97d7; font-weight: bold;">else</span>{
    printf(<span style="color: #2d9574;">"Not In\n"</span>);
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
