c.org
*** 1D array and 1D Point array [] > * > +

*(p+1)== p[1]  and *p+1 == (*p)+1 
#+begin_src C :results output
#include <stdio.h>
void funaa(char **p){
  printf("address mani after 2\n");
  printf("funaa : %c\n", *p[0] );
}
void funbb(int **p){
  printf("address mani after 2\n");
  printf("funbb : %d\n", *p[0] );
}
void funa(char **p){
  printf("value mani: \n");
  printf("funa: the first %c\n", **p );
  printf("funa: the third %c\n", *(   (*p+1)    +1)      );
  char *pa = *p+2;
  funaa(&pa);
  }
void funb(int **p){
  printf("\n");
  printf("value mani: \n");
  printf("funb: the first %d\n", **p );
  printf("funa: the third %d\n", *(   (*p+1)    +1)       );
  int *pa = *p +2;
  funbb(&pa);
}

void funChar2OrderPoint(char ** p){
  printf("\n");
  printf("point arrar[0][0]:%c\n", *( *(p+0) +0)           );
  printf("point arrar[0][1]:%c\n", p[0][1]                 );
  printf("point arrar[0][2]:%c\n", *( *(p+0) +2)           );
  printf("point arrar[1][0]:%c\n", *( *(p+1) +0)           );
  printf("point arrar[1][1]:%c\n", *( *(p+1) +1)           );
  printf("point arrar[1][2]:%c\n", *( *(p+1) +2)           );
  printf("point arrar[2][0]:%c\n", *( *(p+2) +0)           );
  printf("point arrar[2][1]:%c\n", *( *(p+2) +1)           );
  printf("point arrar[2][2]:%c\n", *( *(p+2) +2)           );
}
void funInt2OrderPoint(int ** p){
  printf("\n");
  printf("point arrar[0][0]:%d\n", *( *(p+0) +0)           );
  printf("point arrar[0][1]:%d\n", *( *(p+0) +1)           );
  printf("point arrar[0][2]:%d\n", p[0][2]                 );
  printf("point arrar[1][0]:%d\n", *( *(p+1) +0)           );
  printf("point arrar[1][1]:%d\n", *( *(p+1) +1)           );
  printf("point arrar[1][2]:%d\n", *( *(p+1) +2)           );
  printf("point arrar[2][0]:%d\n", *( *(p+2) +0)           );
  printf("point arrar[2][1]:%d\n", *( *(p+2) +1)           );
  printf("point arrar[2][2]:%d\n", *( *(p+2) +2)           );
}
int main(int argc, char *argv[])
{
  /* char 一维数组转二级指针 */
  char a[] ="1234567";
  char *pa = a;
  funa(&pa);
  /* int 一维数组转二级指针 */
  int b[] = {1,2,3,4,5,6,7};
  int *pb = b;
  funb(&pb);
  /* char 指针数组转二级指针 */
  char a1[] ="123";
  char a2[] = "456";
  char a3[] = "789";
  char *chara [] = {"123", "456", "789"};
  char **poa = chara;
  funChar2OrderPoint(poa);
  printf("\n");
  printf("%s\n", *chara+2 );
  printf("%s\n", *chara+1 );
  printf("%s\n", *chara   );
  printf("\n");
  printf("%s\n", chara[0] );
  printf("%s\n", chara[1] );
  printf("%s\n", chara[2] );
  printf("\n");
  printf("%c\n",      chara[1][2]         );
  printf("%c\n",*(    chara[1]      +2)   );
  printf("%c\n",*(   *(chara+1)     +2)   );

  /* int 指针数组转二级指针 */
  int b1[] = {1,2,3};
  int b2[] = {4,5,6};
  int b3[] = {7,8,9};
  int *intb [3] = {b1, b2, b3};
  int **pob = intb;
  funInt2OrderPoint(pob);
  printf("\n");
  printf("如果打开评论，可以执行，但是会报警告，结果是对应元素的地址\n");
  // printf("%d\n", *intb+2 ); //&3
  // printf("%d\n", *intb+1 ); //&2
  // printf("%d\n", *intb   ); //&1
  // printf("\n");
  // printf("%d\n", intb[0] );  //&123
  // printf("%d\n", intb[1] );  //&456
  // printf("%d\n", intb[2] );  //&789
  printf("\n");
  printf("%d\n",      intb[1][2]         );
  printf("%d\n",*(    intb[1]      +2)   );
  printf("%d\n",*(   *(intb+1)     +2)   );

  return 0;
}

#+end_src

#+RESULTS:
#+begin_example
value mani: 
funa: the first 1
funa: the third 3
address mani after 2
funaa : 3

value mani: 
funb: the first 1
funa: the third 3
address mani after 2
funbb : 3

point arrar[0][0]:1
point arrar[0][1]:2
point arrar[0][2]:3
point arrar[1][0]:4
point arrar[1][1]:5
point arrar[1][2]:6
point arrar[2][0]:7
point arrar[2][1]:8
point arrar[2][2]:9

3
23
123

123
456
789

6
6
6

point arrar[0][0]:1
point arrar[0][1]:2
point arrar[0][2]:3
point arrar[1][0]:4
point arrar[1][1]:5
point arrar[1][2]:6
point arrar[2][0]:7
point arrar[2][1]:8
point arrar[2][2]:9

如果打开评论，可以执行，但是会报警告，结果是对应元素的地址

6
6
6
#+end_example

* Polymorphism
多态可以在面向对象的三种语言中实现，C++, Java, Python
