c.html

<div id="outline-container-orga363b77" class="outline-4">
<h4 id="orga363b77">1D array and 1D Point array [] &gt; * &gt; +</h4>
<div class="outline-text-4" id="text-orga363b77">
<p>
*(p+1)== p[1]  and *p+1 == (*p)+1 
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">funaa</span>(<span style="color: #ce537a; font-weight: bold;">char</span> **<span style="color: #7590db;">p</span>){
  printf(<span style="color: #2d9574;">"address mani after 2\n"</span>);
  printf(<span style="color: #2d9574;">"funaa : %c\n"</span>, *p[0] );
}
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">funbb</span>(<span style="color: #ce537a; font-weight: bold;">int</span> **<span style="color: #7590db;">p</span>){
  printf(<span style="color: #2d9574;">"address mani after 2\n"</span>);
  printf(<span style="color: #2d9574;">"funbb : %d\n"</span>, *p[0] );
}
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">funa</span>(<span style="color: #ce537a; font-weight: bold;">char</span> **<span style="color: #7590db;">p</span>){
  printf(<span style="color: #2d9574;">"value mani: \n"</span>);
  printf(<span style="color: #2d9574;">"funa: the first %c\n"</span>, **p );
  printf(<span style="color: #2d9574;">"funa: the third %c\n"</span>, *(   (*p+1)    +1)      );
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">pa</span> = *p+2;
  funaa(&amp;pa);
  }
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">funb</span>(<span style="color: #ce537a; font-weight: bold;">int</span> **<span style="color: #7590db;">p</span>){
  printf(<span style="color: #2d9574;">"\n"</span>);
  printf(<span style="color: #2d9574;">"value mani: \n"</span>);
  printf(<span style="color: #2d9574;">"funb: the first %d\n"</span>, **p );
  printf(<span style="color: #2d9574;">"funa: the third %d\n"</span>, *(   (*p+1)    +1)       );
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">pa</span> = *p +2;
  funbb(&amp;pa);
}

<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">funChar2OrderPoint</span>(<span style="color: #ce537a; font-weight: bold;">char</span> ** <span style="color: #7590db;">p</span>){
  printf(<span style="color: #2d9574;">"\n"</span>);
  printf(<span style="color: #2d9574;">"point arrar[0][0]:%c\n"</span>, *( *(p+0) +0)           );
  printf(<span style="color: #2d9574;">"point arrar[0][1]:%c\n"</span>, p[0][1]                 );
  printf(<span style="color: #2d9574;">"point arrar[0][2]:%c\n"</span>, *( *(p+0) +2)           );
  printf(<span style="color: #2d9574;">"point arrar[1][0]:%c\n"</span>, *( *(p+1) +0)           );
  printf(<span style="color: #2d9574;">"point arrar[1][1]:%c\n"</span>, *( *(p+1) +1)           );
  printf(<span style="color: #2d9574;">"point arrar[1][2]:%c\n"</span>, *( *(p+1) +2)           );
  printf(<span style="color: #2d9574;">"point arrar[2][0]:%c\n"</span>, *( *(p+2) +0)           );
  printf(<span style="color: #2d9574;">"point arrar[2][1]:%c\n"</span>, *( *(p+2) +1)           );
  printf(<span style="color: #2d9574;">"point arrar[2][2]:%c\n"</span>, *( *(p+2) +2)           );
}
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">funInt2OrderPoint</span>(<span style="color: #ce537a; font-weight: bold;">int</span> ** <span style="color: #7590db;">p</span>){
  printf(<span style="color: #2d9574;">"\n"</span>);
  printf(<span style="color: #2d9574;">"point arrar[0][0]:%d\n"</span>, *( *(p+0) +0)           );
  printf(<span style="color: #2d9574;">"point arrar[0][1]:%d\n"</span>, *( *(p+0) +1)           );
  printf(<span style="color: #2d9574;">"point arrar[0][2]:%d\n"</span>, p[0][2]                 );
  printf(<span style="color: #2d9574;">"point arrar[1][0]:%d\n"</span>, *( *(p+1) +0)           );
  printf(<span style="color: #2d9574;">"point arrar[1][1]:%d\n"</span>, *( *(p+1) +1)           );
  printf(<span style="color: #2d9574;">"point arrar[1][2]:%d\n"</span>, *( *(p+1) +2)           );
  printf(<span style="color: #2d9574;">"point arrar[2][0]:%d\n"</span>, *( *(p+2) +0)           );
  printf(<span style="color: #2d9574;">"point arrar[2][1]:%d\n"</span>, *( *(p+2) +1)           );
  printf(<span style="color: #2d9574;">"point arrar[2][2]:%d\n"</span>, *( *(p+2) +2)           );
}
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{
  <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">char &#19968;&#32500;&#25968;&#32452;&#36716;&#20108;&#32423;&#25351;&#38024;</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">a</span>[] =<span style="color: #2d9574;">"1234567"</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">pa</span> = a;
  funa(&amp;pa);
  <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">int &#19968;&#32500;&#25968;&#32452;&#36716;&#20108;&#32423;&#25351;&#38024;</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>[] = {1,2,3,4,5,6,7};
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">pb</span> = b;
  funb(&amp;pb);
  <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">char &#25351;&#38024;&#25968;&#32452;&#36716;&#20108;&#32423;&#25351;&#38024;</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">a1</span>[] =<span style="color: #2d9574;">"123"</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">a2</span>[] = <span style="color: #2d9574;">"456"</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">a3</span>[] = <span style="color: #2d9574;">"789"</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">chara</span> [] = {<span style="color: #2d9574;">"123"</span>, <span style="color: #2d9574;">"456"</span>, <span style="color: #2d9574;">"789"</span>};
  <span style="color: #ce537a; font-weight: bold;">char</span> **<span style="color: #7590db;">poa</span> = chara;
  funChar2OrderPoint(poa);
  printf(<span style="color: #2d9574;">"\n"</span>);
  printf(<span style="color: #2d9574;">"%s\n"</span>, *chara+2 );
  printf(<span style="color: #2d9574;">"%s\n"</span>, *chara+1 );
  printf(<span style="color: #2d9574;">"%s\n"</span>, *chara   );
  printf(<span style="color: #2d9574;">"\n"</span>);
  printf(<span style="color: #2d9574;">"%s\n"</span>, chara[0] );
  printf(<span style="color: #2d9574;">"%s\n"</span>, chara[1] );
  printf(<span style="color: #2d9574;">"%s\n"</span>, chara[2] );
  printf(<span style="color: #2d9574;">"\n"</span>);
  printf(<span style="color: #2d9574;">"%c\n"</span>,      chara[1][2]         );
  printf(<span style="color: #2d9574;">"%c\n"</span>,*(    chara[1]      +2)   );
  printf(<span style="color: #2d9574;">"%c\n"</span>,*(   *(chara+1)     +2)   );

  <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">int &#25351;&#38024;&#25968;&#32452;&#36716;&#20108;&#32423;&#25351;&#38024;</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b1</span>[] = {1,2,3};
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b2</span>[] = {4,5,6};
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b3</span>[] = {7,8,9};
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">intb</span> [3] = {b1, b2, b3};
  <span style="color: #ce537a; font-weight: bold;">int</span> **<span style="color: #7590db;">pob</span> = intb;
  funInt2OrderPoint(pob);
  printf(<span style="color: #2d9574;">"\n"</span>);
  printf(<span style="color: #2d9574;">"&#22914;&#26524;&#25171;&#24320;&#35780;&#35770;&#65292;&#21487;&#20197;&#25191;&#34892;&#65292;&#20294;&#26159;&#20250;&#25253;&#35686;&#21578;&#65292;&#32467;&#26524;&#26159;&#23545;&#24212;&#20803;&#32032;&#30340;&#22320;&#22336;\n"</span>);
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">printf("%d\n", *intb+2 ); //&amp;3</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">printf("%d\n", *intb+1 ); //&amp;2</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">printf("%d\n", *intb   ); //&amp;1</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">printf("\n");</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">printf("%d\n", intb[0] );  //&amp;123</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">printf("%d\n", intb[1] );  //&amp;456</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">printf("%d\n", intb[2] );  //&amp;789</span>
  printf(<span style="color: #2d9574;">"\n"</span>);
  printf(<span style="color: #2d9574;">"%d\n"</span>,      intb[1][2]         );
  printf(<span style="color: #2d9574;">"%d\n"</span>,*(    intb[1]      +2)   );
  printf(<span style="color: #2d9574;">"%d\n"</span>,*(   *(intb+1)     +2)   );

  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}

</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orga74802d" class="outline-2">
<h2 id="orga74802d">Polymorphism</h2>
<div class="outline-text-2" id="text-orga74802d">
<p>
多态可以在面向对象的三种语言中实现，C++, Java, Python
</p>
</div>
