c.org
** C++ 先基后子
需要借助虚函数来实现对相应多态函数的调用，在函数前加上virtual
#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;

  class Animal
  {
  public:
    Animal();
    virtual run();
  };
  Animal::Animal(){};
  void Animal::run(){cout <<"Animal is running"<<endl;}

  class Dog : public Animal
  {
  public:
    Dog();
    virtual run();
  };
  Dog::Dog(){};
  void Dog::run(){cout <<"Dog is running"<<endl;}

  Animal *p = new Animal;
  p->run();
  p = new Dog;
  p->run();
  //此时的p就是多态变量，但是只有这个变量先由基类生成，再指向子类
  //反之时不能的
#+END_SRC

#+RESULTS:

** Python 可基可子
#+BEGIN_SRC python :results output :session
  class Animal(object):
      def __init__(self):
          self.name ='Animal name'
      def run(self):
          print('Animal is running')

  class Dog(Animal):
      def __init__(self):
          self.name ='Dog name'
      def run(self):
          print('Dog is running')

  # Polymorphism, all Class or instance will be checked the best passing
  # mothode or character
  def run_twice(a):
      a.run()
  def name(b):
      print(b.name)

  ani = Animal()
  ani.name
  ani.run()

  ani = Dog()
  ani.name
  ani.run()
## ani 可以先有基类实现再多态映射到子类，也可以反向实现


#+END_SRC

#+RESULTS:
#+begin_example
Python 3.7.4 (default, Aug 13 2019, 20:35:49) 
[GCC 7.3.0] :: Anaconda, Inc. on linux
Type "help", "copyright", "credits" or "license" for more information.
Animal is running
Dog is running
Cat is running
Dog is running
Animal name
Dog name
Dog name
python.el: native completion setup loaded
#+end_example

