c.html
<div id="outline-container-orgbde6ede" class="outline-3">
<h3 id="orgbde6ede">C++ 先基后子</h3>
<div class="outline-text-3" id="text-orgbde6ede">
<p>
需要借助虚函数来实现对相应多态函数的调用，在函数前加上virtual
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;iostream&gt;</span>
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">std</span>;

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Animal</span>
{
<span style="color: #4f97d7; font-weight: bold;">public</span>:
  <span style="color: #bc6ec5; font-weight: bold;">Animal</span>();
  <span style="color: #4f97d7; font-weight: bold;">virtual</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>();
};
<span style="color: #a45bad;">Animal</span>::<span style="color: #bc6ec5; font-weight: bold;">Animal</span>(){};
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #a45bad;">Animal</span>::<span style="color: #bc6ec5; font-weight: bold;">run</span>(){cout &lt;&lt;<span style="color: #2d9574;">"Animal is running"</span>&lt;&lt;endl;}

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Dog</span> : <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Animal</span>
{
<span style="color: #4f97d7; font-weight: bold;">public</span>:
  <span style="color: #bc6ec5; font-weight: bold;">Dog</span>();
  <span style="color: #4f97d7; font-weight: bold;">virtual</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>();
};
<span style="color: #a45bad;">Dog</span>::<span style="color: #bc6ec5; font-weight: bold;">Dog</span>(){};
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #a45bad;">Dog</span>::<span style="color: #bc6ec5; font-weight: bold;">run</span>(){cout &lt;&lt;<span style="color: #2d9574;">"Dog is running"</span>&lt;&lt;endl;}

<span style="color: #ce537a; font-weight: bold;">Animal</span> *<span style="color: #7590db;">p</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Animal</span>;
p-&gt;run();
p = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Dog</span>;
p-&gt;run();
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#27492;&#26102;&#30340;p&#23601;&#26159;&#22810;&#24577;&#21464;&#37327;&#65292;&#20294;&#26159;&#21482;&#26377;&#36825;&#20010;&#21464;&#37327;&#20808;&#30001;&#22522;&#31867;&#29983;&#25104;&#65292;&#20877;&#25351;&#21521;&#23376;&#31867;</span>
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#21453;&#20043;&#26102;&#19981;&#33021;&#30340;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d3f498" class="outline-3">
<h3 id="org3d3f498">Python 可基可子</h3>
<div class="outline-text-3" id="text-org3d3f498">
<div class="org-src-container">
<pre class="src src-python"><span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Animal</span>(<span style="color: #4f97d7;">object</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
          <span style="color: #4f97d7; font-weight: bold;">self</span>.name =<span style="color: #2d9574;">'Animal name'</span>
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
          <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">'Animal is running'</span>)

<span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Dog</span>(Animal):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
          <span style="color: #4f97d7; font-weight: bold;">self</span>.name =<span style="color: #2d9574;">'Dog name'</span>
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
          <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">'Dog is running'</span>)

<span style="background-color: #292e34;"> </span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Polymorphism, all Class or instance will be checked the best passing</span>
<span style="background-color: #292e34;"> </span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">mothode or character</span>
<span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run_twice</span>(a):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> a.run()
<span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">name</span>(b):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">print</span>(b.name)

<span style="background-color: #292e34;"> </span> <span style="color: #7590db;">ani</span> = Animal()
<span style="background-color: #292e34;"> </span> ani.name
<span style="background-color: #292e34;"> </span> ani.run()

<span style="background-color: #292e34;"> </span> <span style="color: #7590db;">ani</span> = Dog()
<span style="background-color: #292e34;"> </span> ani.name
<span style="background-color: #292e34;"> </span> ani.run()
<span style="color: #2aa1ae; background-color: #292e34;">## </span><span style="color: #2aa1ae; background-color: #292e34;">ani &#21487;&#20197;&#20808;&#26377;&#22522;&#31867;&#23454;&#29616;&#20877;&#22810;&#24577;&#26144;&#23556;&#21040;&#23376;&#31867;&#65292;&#20063;&#21487;&#20197;&#21453;&#21521;&#23454;&#29616;</span>


</pre>
</div>
</div>
</div>
