c.org
** Java 先子后基，还必须子实列指向基类型
#+BEGIN_SRC java 
class Figure {
    double dim1;
    double dim2;
    Figure(double d1, double d2) {
        // 有参的构造方法
        this.dim1 = d1;
        this.dim2 = d2;
    }
    double area() {
        // 用于计算对象的面积
        System.out.println("父类中计算对象面积的方法，没有实际意义，需要在子类中重写。");
        return 0;
    }
}

class Rectangle extends Figure {
    Rectangle(double d1, double d2) {
        super(d1, d2);
    }
    double area() {
        System.out.println("长方形的面积：");
        return super.dim1 * super.dim2;
    }
}

class Triangle extends Figure {
    Triangle(double d1, double d2) {
        super(d1, d2);
    }
    double area() {
        System.out.println("三角形的面积：");
        return super.dim1 * super.dim2 / 2;
    }
}

public class Test {
    public static void main(String[] args) {

        Figure figure = new Rectangle(9, 9);
        System.out.println(figure.area());
        System.out.println("===============================");
        figure = new Triangle(6, 8);
        System.out.println(figure.area());
        System.out.println("===============================");
        figure = new Figure(10, 10);
        System.out.println(figure.area());

    }
}

  //此时的p就是多态变量，但是只有这个变量先由基类生成，再指向子类
  //反之时不能的. 而且子类实列使用基类类型

#+END_SRC

* Scanf
** input matching for multi input Scanf() 
可以直接从控制台接受8， 10， 16 进制的数
只有当控制字符串以格式控制符(%d、%c、%f) 开头时，键入的input才会忽略换行符,
否则输入的空白符就不能忽略了，它会参与匹配过程
** 清空每次输入的所有缓存
scanf("%*[^\n]"); scanf("%*c");
** Scanf(%{*}{width}type)
其中，{ } 表示可有可无。各个部分的具体含义是：
type表示读取什么类型的数据，例如 %d、%s、%[a-z]、%[^\n] 等；type 必须有。
width表示最大读取宽度，可有可无。
*表示丢弃读取到的数据，可有可无。
** each time only reserive 3 agruments
#+BEGIN_SRC C :results output 
  #include <stdio.h>
  #include <string.h>
  int main(int argc, char *argv[])
  {
    while(1){
      char a[3][10] = {"", "", ""};
      char b[100];
      scanf("%[^\n]", b);
      printf("b is %s\n", b);
      int j = 0;
      int i = 0;
      do{
        int k = 0;
        do{
          a[j][k] = b[i];
          i++;
          k++;
        }while(b[i] != ' ');
        printf("a[%d] iooooos %s\n", j, a[j]);
        j++;
        i++;
      }  while (j<3);
      scanf("%*[^\n]"); scanf("%*c");
    }
  //  return 0;
    }

#+END_SRC

** special requirements
- Each time ask default 3 agreements, less is ok, the more will be ignored.
- scanf("%s", a); can't deal with more agreements.
 the more will be read next time
- scanf("%[^\n]", a); can't deal with less agreements, 
because without \n, I don't know where to stop 

- scanf("c%",a); can use '\n' and ' ' to determine the stop and number
  of agreements.

* Notes
** pass the agruments to program
#+BEGIN_SRC 
在src block 中提前定义:var a = 3
javac test.java &&  echo 1 |java test 可以将1向StdInt传入
gcc test.c && echo 1 | ./a.out 可以将1向scanf("%d", &a)传入的a
#+END_SRC
** malloc for 2 diamesion
  char ** commands;
  commands = (char **)malloc(NUMOFCOM * sizeof(char *));
  for (int n = 0; n < NUMOFCOM; n++)
    commands[n] = (char *)malloc(sizeof(char) * COMLONG);
** pass 2 diamesion array to function
Even in function the index if out of the boundary of array, will be no
error hit, and only return the valid index boundary.
** char for string
char can define string with point (char *str) or with array(char
str[]). but char *str cann't be changed anymore.

** Headfile
#+BEGIN_SRC 

old C(xx.h) add c at first and sub .h > C++
old C++ (xxx.h) aub .h > C++
#+END_SRC
** reference
#+BEGIN_SRC 

1. 如果在函数体中修改了形参的数据，那么实参的数据也会被修改，从而拥有“在
   函数内部影响函数外部数据”的效果

2. 不能返回局部数据（例如局部变量、局部对象、局部数组等）的引用，因为
   当函数调用完成后局部数据就会被销毁，有可能在下次使用时数据就不存在
   了

3. 给引用添加 const 限定后，不但可以将引用绑定到临时数据，还可以将引用
   绑定到类型相近的数据，这使得引用更加灵活和通用，它们背后的机制都是
   临时变量
#+END_SRC

