c.html

<div id="outline-container-org40c7069" class="outline-3">
<h3 id="org40c7069">Java 先子后基，还必须子实列指向基类型</h3>
<div class="outline-text-3" id="text-org40c7069">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Figure</span> {
    <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">dim1</span>;
    <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">dim2</span>;
    Figure(<span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">d1</span>, <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">d2</span>) {
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#26377;&#21442;&#30340;&#26500;&#36896;&#26041;&#27861;</span>
        <span style="color: #4f97d7; font-weight: bold;">this</span>.dim1 = d1;
        <span style="color: #4f97d7; font-weight: bold;">this</span>.dim2 = d2;
    }
    <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">area</span>() {
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#29992;&#20110;&#35745;&#31639;&#23545;&#35937;&#30340;&#38754;&#31215;</span>
        System.out.println(<span style="color: #2d9574;">"&#29238;&#31867;&#20013;&#35745;&#31639;&#23545;&#35937;&#38754;&#31215;&#30340;&#26041;&#27861;&#65292;&#27809;&#26377;&#23454;&#38469;&#24847;&#20041;&#65292;&#38656;&#35201;&#22312;&#23376;&#31867;&#20013;&#37325;&#20889;&#12290;"</span>);
        <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
    }
}

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Rectangle</span> <span style="color: #4f97d7; font-weight: bold;">extends</span> <span style="color: #ce537a; font-weight: bold;">Figure</span> {
    Rectangle(<span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">d1</span>, <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">d2</span>) {
        <span style="color: #4f97d7; font-weight: bold;">super</span>(d1, d2);
    }
    <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">area</span>() {
        System.out.println(<span style="color: #2d9574;">"&#38271;&#26041;&#24418;&#30340;&#38754;&#31215;&#65306;"</span>);
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">super</span>.dim1 * <span style="color: #4f97d7; font-weight: bold;">super</span>.dim2;
    }
}

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Triangle</span> <span style="color: #4f97d7; font-weight: bold;">extends</span> <span style="color: #ce537a; font-weight: bold;">Figure</span> {
    Triangle(<span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">d1</span>, <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">d2</span>) {
        <span style="color: #4f97d7; font-weight: bold;">super</span>(d1, d2);
    }
    <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">area</span>() {
        System.out.println(<span style="color: #2d9574;">"&#19977;&#35282;&#24418;&#30340;&#38754;&#31215;&#65306;"</span>);
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">super</span>.dim1 * <span style="color: #4f97d7; font-weight: bold;">super</span>.dim2 / 2;
    }
}

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Test</span> {
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">String</span>[] <span style="color: #7590db;">args</span>) {

        <span style="color: #ce537a; font-weight: bold;">Figure</span> <span style="color: #7590db;">figure</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Rectangle</span>(9, 9);
        System.out.println(figure.area());
        System.out.println(<span style="color: #2d9574;">"==============================="</span>);
        figure = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Triangle</span>(6, 8);
        System.out.println(figure.area());
        System.out.println(<span style="color: #2d9574;">"==============================="</span>);
        figure = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Figure</span>(10, 10);
        System.out.println(figure.area());

    }
}

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#27492;&#26102;&#30340;p&#23601;&#26159;&#22810;&#24577;&#21464;&#37327;&#65292;&#20294;&#26159;&#21482;&#26377;&#36825;&#20010;&#21464;&#37327;&#20808;&#30001;&#22522;&#31867;&#29983;&#25104;&#65292;&#20877;&#25351;&#21521;&#23376;&#31867;</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#21453;&#20043;&#26102;&#19981;&#33021;&#30340;. &#32780;&#19988;&#23376;&#31867;&#23454;&#21015;&#20351;&#29992;&#22522;&#31867;&#31867;&#22411;</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org648b7da" class="outline-2">
<h2 id="org648b7da">Scanf</h2>
<div class="outline-text-2" id="text-org648b7da">
</div>
<div id="outline-container-org3499b9f" class="outline-3">
<h3 id="org3499b9f">input matching for multi input Scanf()</h3>
<div class="outline-text-3" id="text-org3499b9f">
<p>
可以直接从控制台接受8， 10， 16 进制的数
只有当控制字符串以格式控制符(%d、%c、%f) 开头时，键入的input才会忽略换行符,
否则输入的空白符就不能忽略了，它会参与匹配过程
</p>
</div>
</div>
<div id="outline-container-org52d5823" class="outline-3">
<h3 id="org52d5823">清空每次输入的所有缓存</h3>
<div class="outline-text-3" id="text-org52d5823">
<p>
scanf("%*[^\n]"); scanf("%*c");
</p>
</div>
</div>
<div id="outline-container-org9d48997" class="outline-3">
<h3 id="org9d48997">Scanf(%{*}{width}type)</h3>
<div class="outline-text-3" id="text-org9d48997">
<p>
其中，{ } 表示可有可无。各个部分的具体含义是：
type表示读取什么类型的数据，例如 %d、%s、%[a-z]、%[^\n] 等；type 必须有。
width表示最大读取宽度，可有可无。
*表示丢弃读取到的数据，可有可无。
</p>
</div>
</div>
<div id="outline-container-org95026bd" class="outline-3">
<h3 id="org95026bd">each time only reserive 3 agruments</h3>
<div class="outline-text-3" id="text-org95026bd">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;string.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>[])
{
  <span style="color: #4f97d7; font-weight: bold;">while</span>(1){
    <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">a</span>[3][10] = {<span style="color: #2d9574;">""</span>, <span style="color: #2d9574;">""</span>, <span style="color: #2d9574;">""</span>};
    <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">b</span>[100];
    scanf(<span style="color: #2d9574;">"%[^\n]"</span>, b);
    printf(<span style="color: #2d9574;">"b is %s\n"</span>, b);
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0;
    <span style="color: #4f97d7; font-weight: bold;">do</span>{
      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">k</span> = 0;
      <span style="color: #4f97d7; font-weight: bold;">do</span>{
        a[j][k] = b[i];
        i++;
        k++;
      }<span style="color: #4f97d7; font-weight: bold;">while</span>(b[i] != <span style="color: #2d9574;">' '</span>);
      printf(<span style="color: #2d9574;">"a[%d] iooooos %s\n"</span>, j, a[j]);
      j++;
      i++;
    }  <span style="color: #4f97d7; font-weight: bold;">while</span> (j&lt;3);
    scanf(<span style="color: #2d9574;">"%*[^\n]"</span>); scanf(<span style="color: #2d9574;">"%*c"</span>);
  }
<span style="color: #2aa1ae; background-color: #292e34;">//  </span><span style="color: #2aa1ae; background-color: #292e34;">return 0;</span>
  }

</pre>
</div>
</div>
</div>

<div id="outline-container-org9b83949" class="outline-3">
<h3 id="org9b83949">special requirements</h3>
<div class="outline-text-3" id="text-org9b83949">
<ul class="org-ul">
<li>Each time ask default 3 agreements, less is ok, the more will be ignored.</li>
<li>scanf("%s", a); can't deal with more agreements.
the more will be read next time</li>
<li>scanf("%[^\n]", a); can't deal with less agreements,</li>
</ul>
<p>
because without \n, I don't know where to stop 
</p>

<ul class="org-ul">
<li>scanf("c%",a); can use '\n' and ' ' to determine the stop and number
of agreements.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org57744f0" class="outline-2">
<h2 id="org57744f0">Notes</h2>
<div class="outline-text-2" id="text-org57744f0">
</div>
<div id="outline-container-org8111cb9" class="outline-3">
<h3 id="org8111cb9">pass the agruments to program</h3>
<div class="outline-text-3" id="text-org8111cb9">
<pre class="example">
在src block 中提前定义:var a = 3
javac test.java &amp;&amp;  echo 1 |java test 可以将1向StdInt传入
gcc test.c &amp;&amp; echo 1 | ./a.out 可以将1向scanf("%d", &amp;a)传入的a
</pre>
</div>
</div>
<div id="outline-container-org4587bb7" class="outline-3">
<h3 id="org4587bb7">malloc for 2 diamesion</h3>
<div class="outline-text-3" id="text-org4587bb7">
<p>
char <b>* commands;
commands = (char *</b>)malloc(NUMOFCOM * sizeof(char *));
for (int n = 0; n &lt; NUMOFCOM; n++)
  commands[n] = (char *)malloc(sizeof(char) * COMLONG);
</p>
</div>
</div>
<div id="outline-container-orgb14d31b" class="outline-3">
<h3 id="orgb14d31b">pass 2 diamesion array to function</h3>
<div class="outline-text-3" id="text-orgb14d31b">
<p>
Even in function the index if out of the boundary of array, will be no
error hit, and only return the valid index boundary.
</p>
</div>
</div>
<div id="outline-container-orgc37096a" class="outline-3">
<h3 id="orgc37096a">char for string</h3>
<div class="outline-text-3" id="text-orgc37096a">
<p>
char can define string with point (char *str) or with array(char
str[]). but char *str cann't be changed anymore.
</p>
</div>
</div>

<div id="outline-container-orge5e217b" class="outline-3">
<h3 id="orge5e217b">Headfile</h3>
<div class="outline-text-3" id="text-orge5e217b">
<pre class="example">

old C(xx.h) add c at first and sub .h &gt; C++
old C++ (xxx.h) aub .h &gt; C++
</pre>
</div>
</div>
<div id="outline-container-orgebf3850" class="outline-3">
<h3 id="orgebf3850">reference</h3>
<div class="outline-text-3" id="text-orgebf3850">
<pre class="example">

1. 如果在函数体中修改了形参的数据，那么实参的数据也会被修改，从而拥有“在
   函数内部影响函数外部数据”的效果

2. 不能返回局部数据（例如局部变量、局部对象、局部数组等）的引用，因为
   当函数调用完成后局部数据就会被销毁，有可能在下次使用时数据就不存在
   了

3. 给引用添加 const 限定后，不但可以将引用绑定到临时数据，还可以将引用
   绑定到类型相近的数据，这使得引用更加灵活和通用，它们背后的机制都是
   临时变量
</pre>
</div>
</div>
