c.org
** class
#+BEGIN_SRC 

1. 基类中的 protected 成员可以在派生类中使用，而基类中的 private 成员不能
   在派生类中使用
2. 只有一个作用域内的同名函数才具有重载关系，不同作用域内的同名函数是
   会造成遮蔽
3. 如果基类的成员变量被派生类的成员变量遮蔽， 基类成员仍会在实例化时被
   创建，也可通过域解析符来访问。
4. 构造函数会被逐级的显示或者默认的在派生类中被调用，并且可以被重载
5. C++ 可以多继承不同的类（多继承和重继承），注意其构造函数的调用和成
   员名称冲突，但是可以用域解析符来指明调用
6. 即使是类的private成员，仍能通过创建的对象的地址偏移或者直接利用指针
   进行访问。（有点花里胡哨的）
7. C++中虚函数的唯一用处就是构成多态
8. 引用不像指针灵活，指针可以随时改变指向，而引用只能指代固定的对象
#+END_SRC

** const
#+BEGIN_SRC 

const 的作用在C++中和宏很像#defind
函数中const，修饰变量后可以将传入的参数，强制转换为设定的
初始化 const 成员变量的唯一方法就是使用参数初始化
类中的const， 变量，函数， 类， 只能互相承
重要：在头文件中用const修饰全部变量后，就可以多次被引入了而不会出现重
复定义的错
#+END_SRC
** static
#+BEGIN_SRC 

statis 变量， 函数，全部对象可以共用，访问，无this指针。不能调用普通变量和函数类
static 多被用来计数，可以在外部被改
#+END_SRC
** GDB
GDB debug
can be done in terminal or in Emacs, recommend later one
n
|----------+---------------------------|
| b        | add break point           |
| run      | start the program         |
| run argv | if argv needed            |
| n        | next                      |
| l        | list source code 10 lines |
| p        | print variables           |
| s        | go into functions         |
| ignore   | pass the break point      |
| q        | exit                      |
| set      | set variable              |
|----------+---------------------------|



#+BEGIN_SRC C
  
int a = 3;
printf("%d",a);

#+END_SRC

#+RESULTS:
: 3
* Compile
There are four different kinds of Methods to compile a source file.
** Makefile
There is a folder called Makefile, into this folder, and call
"make" in terminal, don't forget "make clean" to clean it.
** Terminal Compile
In pthread_and_pid folder with terminal with "g++/gcc file.c -o file",
and then "./file" to call it
** Emacs Compile
Also in pthread_and_pid folder, open the resource code with Emacs,
and then M-x compile(C-z k)
call it in minibuffer with :
"gcc -pthread create_pthread.c -o create_pthread && ./create_pthread"
** Orgmode Compile

#+BEGIN_SRC C++ :results output
#include <stdio.h>
int main()
{
printf("nihao");
return 0;
}

#+END_SRC

#+RESULTS:
: nihao


* GDB
** command
| r   | b     | u     | c        | n    | l    | j    | p     | q    | fi     | return |
| run | break | until | continue | next | list | jump | print | quit | finish | return |
|     |       |       |          |      |      |      |       |      |        |        |

| clear | delete |
|       |        |


** Problems
in emacs, if scanf, the in put can not be given in
gdb buffer. if it comes to scanf, go to the I/O buffer,
and input the value , go back to gdb buffer, just next
