c.html

<div id="outline-container-org3d86e94" class="outline-3">
<h3 id="org3d86e94">class</h3>
<div class="outline-text-3" id="text-org3d86e94">
<pre class="example">

1. 基类中的 protected 成员可以在派生类中使用，而基类中的 private 成员不能
   在派生类中使用
2. 只有一个作用域内的同名函数才具有重载关系，不同作用域内的同名函数是
   会造成遮蔽
3. 如果基类的成员变量被派生类的成员变量遮蔽， 基类成员仍会在实例化时被
   创建，也可通过域解析符来访问。
4. 构造函数会被逐级的显示或者默认的在派生类中被调用，并且可以被重载
5. C++ 可以多继承不同的类（多继承和重继承），注意其构造函数的调用和成
   员名称冲突，但是可以用域解析符来指明调用
6. 即使是类的private成员，仍能通过创建的对象的地址偏移或者直接利用指针
   进行访问。（有点花里胡哨的）
7. C++中虚函数的唯一用处就是构成多态
8. 引用不像指针灵活，指针可以随时改变指向，而引用只能指代固定的对象
</pre>
</div>
</div>

<div id="outline-container-orgc20c89f" class="outline-3">
<h3 id="orgc20c89f">const</h3>
<div class="outline-text-3" id="text-orgc20c89f">
<pre class="example">

const 的作用在C++中和宏很像#defind
函数中const，修饰变量后可以将传入的参数，强制转换为设定的
初始化 const 成员变量的唯一方法就是使用参数初始化
类中的const， 变量，函数， 类， 只能互相承
重要：在头文件中用const修饰全部变量后，就可以多次被引入了而不会出现重
复定义的错
</pre>
</div>
</div>
<div id="outline-container-org220f360" class="outline-3">
<h3 id="org220f360">static</h3>
<div class="outline-text-3" id="text-org220f360">
<pre class="example">

statis 变量， 函数，全部对象可以共用，访问，无this指针。不能调用普通变量和函数类
static 多被用来计数，可以在外部被改
</pre>
</div>
</div>
<div id="outline-container-org4731680" class="outline-3">
<h3 id="org4731680">GDB</h3>
<div class="outline-text-3" id="text-org4731680">
<p>
GDB debug
can be done in terminal or in Emacs, recommend later one
n
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">b</td>
<td class="org-left">add break point</td>
</tr>

<tr>
<td class="org-left">run</td>
<td class="org-left">start the program</td>
</tr>

<tr>
<td class="org-left">run argv</td>
<td class="org-left">if argv needed</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">next</td>
</tr>

<tr>
<td class="org-left">l</td>
<td class="org-left">list source code 10 lines</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">print variables</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">go into functions</td>
</tr>

<tr>
<td class="org-left">ignore</td>
<td class="org-left">pass the break point</td>
</tr>

<tr>
<td class="org-left">q</td>
<td class="org-left">exit</td>
</tr>

<tr>
<td class="org-left">set</td>
<td class="org-left">set variable</td>
</tr>
</tbody>
</table>



<div class="org-src-container">
<pre class="src src-C">
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span> = 3;
printf(<span style="color: #2d9574;">"%d"</span>,a);

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3727cb4" class="outline-2">
<h2 id="org3727cb4">Compile</h2>
<div class="outline-text-2" id="text-org3727cb4">
<p>
There are four different kinds of Methods to compile a source file.
</p>
</div>
<div id="outline-container-orga2b62e0" class="outline-3">
<h3 id="orga2b62e0">Makefile</h3>
<div class="outline-text-3" id="text-orga2b62e0">
<p>
There is a folder called Makefile, into this folder, and call
"make" in terminal, don't forget "make clean" to clean it.
</p>
</div>
</div>
<div id="outline-container-orgffdf478" class="outline-3">
<h3 id="orgffdf478">Terminal Compile</h3>
<div class="outline-text-3" id="text-orgffdf478">
<p>
In pthread<sub>and</sub><sub>pid</sub> folder with terminal with "g++/gcc file.c -o file",
and then "./file" to call it
</p>
</div>
</div>
<div id="outline-container-org53baa51" class="outline-3">
<h3 id="org53baa51">Emacs Compile</h3>
<div class="outline-text-3" id="text-org53baa51">
<p>
Also in pthread<sub>and</sub><sub>pid</sub> folder, open the resource code with Emacs,
and then M-x compile(C-z k)
call it in minibuffer with :
"gcc -pthread create<sub>pthread.c</sub> -o create<sub>pthread</sub> &amp;&amp; ./create<sub>pthread</sub>"
</p>
</div>
</div>
<div id="outline-container-orgb778bdc" class="outline-3">
<h3 id="orgb778bdc">Orgmode Compile</h3>
<div class="outline-text-3" id="text-orgb778bdc">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>()
{
printf(<span style="color: #2d9574;">"nihao"</span>);
<span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}

</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgdc18a12" class="outline-2">
<h2 id="orgdc18a12">GDB</h2>
<div class="outline-text-2" id="text-orgdc18a12">
</div>
<div id="outline-container-orgc3888d2" class="outline-3">
<h3 id="orgc3888d2">command</h3>
<div class="outline-text-3" id="text-orgc3888d2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">r</td>
<td class="org-left">b</td>
<td class="org-left">u</td>
<td class="org-left">c</td>
<td class="org-left">n</td>
<td class="org-left">l</td>
<td class="org-left">j</td>
<td class="org-left">p</td>
<td class="org-left">q</td>
<td class="org-left">fi</td>
<td class="org-left">return</td>
</tr>

<tr>
<td class="org-left">run</td>
<td class="org-left">break</td>
<td class="org-left">until</td>
<td class="org-left">continue</td>
<td class="org-left">next</td>
<td class="org-left">list</td>
<td class="org-left">jump</td>
<td class="org-left">print</td>
<td class="org-left">quit</td>
<td class="org-left">finish</td>
<td class="org-left">return</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">clear</td>
<td class="org-left">delete</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org5c3401a" class="outline-3">
<h3 id="org5c3401a">Problems</h3>
<div class="outline-text-3" id="text-org5c3401a">
<p>
in emacs, if scanf, the in put can not be given in
gdb buffer. if it comes to scanf, go to the I/O buffer,
and input the value , go back to gdb buffer, just next
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: silin</p>
<p class="date">Created: 2020-11-23 Mo 20:50</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
